Table of Contents
 Interface IBIMPluginFactory
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
public interface IBIMPluginFactory
Properties
 FeaAppName
string FeaAppName { get; }
Property Value
string
 IdeaStaticaAppPath
string IdeaStaticaAppPath { get; }
Property Value
string
Methods
 Create()
IApplicationBIM Create()
Returns
IApplicationBIM
 Edit this page